# Dependencies should be added here first and then installed with `brew bundle`. To generate a list of all installed
# packages (including casks), do something like the following.
#
# brew leaves | sort | xargs -n 1 brew desc
# brew list --cask | sort | xargs -n 1 brew desc --cask

tap 'helix-editor/helix' # https://github.com/helix-editor/helix

brew 'act' # Run your GitHub Actions locally 🚀
brew 'automake' # Tool for generating GNU Standards-compliant Makefiles
brew 'awscli' # Official Amazon AWS command-line interface
brew 'bash' # Bourne-Again SHell, a UNIX command interpreter
brew 'bash-completion' # Programmable completion for Bash 3.2
brew 'circleci' # Enables you to reproduce the CircleCI environment locally
brew 'cmake' # Cross-platform make
brew 'diffr' # LCS based diff highlighting tool to ease code review from your terminal
brew 'dnsmasq' # Lightweight DNS forwarder and DHCP server
brew 'fzf' # Command-line fuzzy finder written in Go
brew 'gawk' # GNU awk utility
brew 'gh' # GitHub command-line tool
brew 'gifski' # Highest-quality GIF encoder based on pngquant
brew 'git' # Distributed revision control system
brew 'git-lfs' # Git extension for versioning large files
brew 'gnupg' # GNU Pretty Good Privacy (PGP) package
brew 'graphviz' # Graph visualization software from AT&T and Bell Labs
brew 'helix' # Post-modern modal text editor
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'lua' # Powerful, lightweight programming language
brew 'mysql' # Open source relational database management system
brew 'ncurses' # Text-based UI library
brew 'nghttp2' # HTTP/2 C Library
brew 'nvm' # Manage multiple Node.js versions
brew 'openjdk' # Development kit for the Java programming language
brew 'pango' # Framework for layout and rendering of i18n text
brew 'parallel' # Shell command parallelization utility
brew 'pinentry-mac' # Pinentry for GPG on Mac
brew 'postgresql' # Object-relational database system
brew 'pyenv' # Python version management
brew 'python@3.10' # Interpreted, interactive, object-oriented programming language
brew 'rbenv' # Ruby version manager
brew 'scrcpy' # Display and control your Android device
brew 'swig' # Generate scripting interfaces to C/C++ code
brew 'tmate' # Instant terminal sharing
brew 'xcnotary' # macOS app notarization helper

cask '1password' # Password manager that keeps all passwords secure behind one password
cask 'affinity-photo' # Professional image editing software
cask 'aws-vault' # Securely stores and accesses AWS credentials in a development environment
cask 'azure-data-studio' # Data management tool that enables working with SQL Server
cask 'dash' # API documentation browser and code snippet manager
cask 'devutils' # Offline toolbox for developers
cask 'discord' # Voice and text chat software
cask 'docker' # App to build and share containerized applications and microservices
cask 'figma' # Collaborative team software
cask 'firefox' # Web browser
cask 'font-fira-code' # Fira Code font
cask 'hammerspoon' # Desktop automation application
cask 'hyper' # Terminal built on web technologies
cask 'insomnia' # HTTP and GraphQL Client
cask 'iterm2' # Terminal emulator as alternative to Apple's Terminal app
cask 'ngrok' # Reverse proxy, secure introspectable tunnels to localhost
cask 'raspberry-pi-imager' # Imaging utility to install operating systems to a microSD card
cask 'rectangle' # Move and resize windows using keyboard shortcuts or snap areas
cask 'spotify' # Music streaming service
cask 'tuple' # Remote pair programming app
cask 'visual-studio-code' # Open-source code editor
cask 'zoom' # Video communication and virtual meeting platform
