tap "akeru-inc/tap"
tap "ankitpokhrel/jira-cli"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"
# Run your GitHub Actions locally
brew "act"
# Zstandard is a real-time compression algorithm
brew "zstd"
# New file format for still image compression
brew "jpeg-xl"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Object-file caching compiler wrapper
brew "ccache"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Cross-platform make
brew "cmake"
# Unit testing framework for C
brew "cmocka"
# LCS based diff highlighting tool to ease code review from your terminal
brew "diffr"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# Compression/decompression library aiming for high speed
brew "snappy"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Post-modern modal text editor
brew "helix"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Powerful, lightweight programming language
brew "lua"
# CLI tool for saving complete web pages as a single HTML file
brew "monolith"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Development kit for the Java programming language
brew "openjdk"
# Shell command parallelization utility
brew "parallel"
# Highly capable, feature-rich programming language
brew "perl"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Display and control your Android device
brew "scrcpy"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Instant terminal sharing
brew "tmate"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# macOS app notarization helper
brew "akeru-inc/tap/xcnotary"
# 🔥 Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Professional image editing software
cask "affinity-photo"
# GPU-accelerated terminal emulator
cask "alacritty"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# API documentation browser and code snippet manager
cask "dash"
# All-in-one toolbox for developers
cask "devutils"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Desktop automation application
cask "hammerspoon"
# Terminal built on web technologies
cask "hyper"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Identity and access management
cask "okta-advanced-server-access"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Remote pair programming app
cask "tuple"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "apollographql.vscode-apollo"
vscode "arcanis.vscode-zipfs"
vscode "austenc.tailwind-docs"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "DotJoshJohnson.xml"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "Jarga.apib"
vscode "karunamurti.haml"
vscode "KoichiSasada.vscode-rdbg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "noku.rails-run-spec-vscode"
vscode "Nuxt.mdc"
vscode "Orta.vscode-jest"
vscode "pushqrdx.inline-html"
vscode "rebornix.ruby"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "Shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "toba.vsfire"
vscode "Tyriar.sort-lines"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "whizkydee.material-palenight-theme"
vscode "wingrunr21.vscode-ruby"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
