tap "akeru-inc/tap"
tap "ankitpokhrel/jira-cli"
tap "facebook/fb"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/services"
tap "libsql/sqld"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "tursodatabase/tap"
# Run your GitHub Actions locally
brew "act"
# Zstandard is a real-time compression algorithm
brew "zstd"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Record and share terminal sessions
brew "asciinema"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy", restart_service: :changed
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Object-file caching compiler wrapper
brew "ccache"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Cross-platform make
brew "cmake"
# Unit testing framework for C
brew "cmocka"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# DNS server that chains plugins
brew "coredns", restart_service: :changed
# GNU File, Shell, and Text utilities
brew "coreutils"
# LCS based diff highlighting tool to ease code review from your terminal
brew "diffr"
# Diff that understands syntax
brew "difftastic"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Text processing system for reStructuredText
brew "docutils"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Compression/decompression library aiming for high speed
brew "snappy"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Next generation open source RPC library and framework
brew "grpc"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Process manager for Procfile-based applications
brew "hivemind"
# Improved top (interactive process viewer)
brew "htop"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Exposes your localhost to the world for easy testing and sharing
brew "localtunnel"
# Powerful, lightweight programming language
brew "lua"
# Drop-in replacement for MySQL
brew "mariadb@10.11"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# CLI tool for saving complete web pages as a single HTML file
brew "monolith"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql@8.0", restart_service: :changed
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Libraries for security-enabled client and server applications
brew "nss"
# Package for scientific computing with Python
brew "numpy"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Command-line tools for MySQL, MariaDB and system tasks
brew "percona-toolkit"
# Highly capable, feature-rich programming language
brew "perl"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Install various Ruby versions and implementations
brew "ruby-build"
# Rust toolchain installer
brew "rustup"
# Display and control your Android device
brew "scrcpy"
# Export Slack data without admin privileges
brew "slackdump"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Instant terminal sharing
brew "tmate"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# macOS app notarization helper
brew "akeru-inc/tap/xcnotary"
# Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# A Powerful Command Line for automating iOS Simulators
brew "facebook/fb/idb-companion"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
brew "tursodatabase/tap/turso"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Professional image editing software
cask "affinity-photo"
# Enable Windows-like alt-tab
cask "alt-tab"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault-binary"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# 3D creation suite
cask "blender"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# API documentation browser and code snippet manager
cask "dash"
# Virtual monitor for screen sharing
cask "deskpad"
# All-in-one toolbox for developers
cask "devutils"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-fira-code"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop automation application
cask "hammerspoon"
# Open source API development ecosystem
cask "hoppscotch"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# ZSA keyboard firmware flasher
cask "keymapp"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# Identity and access management
cask "okta-advanced-server-access"
# AI coding agent desktop client
cask "opencode-desktop"
# Replacement for Docker Desktop
cask "orbstack"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Digital design and prototyping platform
cask "sketch"
# Music streaming service
cask "spotify"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Remote pair programming app
cask "tuple"
# Open-source code editor
cask "visual-studio-code"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Color Picker", id: 1545870783
mas "Dato", id: 1470584107
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "HazeOver", id: 430798174
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
vscode "ahmadalli.vscode-nginx-conf"
vscode "antfu.browse-lite"
vscode "antfu.goto-alias"
vscode "apollographql.vscode-apollo"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "bierner.jsdoc-markdown-highlighting"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dnut.rewrap-revived"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "howardzuo.vscode-favorites"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jarga.apib"
vscode "jock.svg"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "mathiasfrohlich.kotlin"
vscode "matthewpi.caddyfile-support"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "noku.rails-run-spec-vscode"
vscode "nuxt.mdc"
vscode "orta.vscode-jest"
vscode "pushqrdx.inline-html"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rubocop.vscode-rubocop"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sorbet.sorbet-vscode-extension"
vscode "soutaro.rbs-syntax"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "toba.vsfire"
vscode "tonybaloney.vscode-pets"
vscode "tyriar.sort-lines"
vscode "vitest.explorer"
vscode "vortizhe.simple-ruby-erb"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "whizkydee.material-palenight-theme"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
go "cmd/go"
go "cmd/gofmt"
cargo "tuckr"
