arcanis.vscode-zipfs
austenc.tailwind-docs
bradlc.vscode-tailwindcss
bungcip.better-toml
dawhite.mustache
dtsvet.vscode-wasm
eamodio.gitlens
GitHub.github-vscode-theme
GraphQL.vscode-graphql
hashicorp.terraform
Jarga.apib
jcbuisson.vue
karunamurti.haml
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
noku.rails-run-spec-vscode
octref.vetur
Orta.vscode-jest
pushqrdx.inline-html
rebornix.ruby
redhat.vscode-commons
redhat.vscode-yaml
sianglim.slim
svelte.svelte-vscode
syler.sass-indented
toba.vsfire
Tyriar.sort-lines
Vue.volar
Vue.vscode-typescript-vue-plugin
whizkydee.material-palenight-theme
wingrunr21.vscode-ruby
yzhang.markdown-all-in-one
zardoy.vetur-extended
